app/controllers/admin_controller.rb

SELECT "admins".* FROM "admins" WHERE "admins"."email_id" = $1 LIMIT $2  [["email_id", "admin@tamu.edu"], ["LIMIT", 1]]
---
    def authenticate
      @admin = Admin.find_by(email_id: params[:admin][:email_id])