app/controllers/faculty_controller.rb

    def authenticate
      @faculty = Faculty.find_by(email_id: params[:faculty][:email_id])
---
SELECT "faculties".* FROM "faculties" WHERE "faculties"."email_id" = $1 LIMIT $2  [["email_id", "profexample@tamu.edu"], ["LIMIT", 1]]

    def dashboard
      @faculty = current_faculty
      if @faculty
        @students_to_review = Student.includes(:committees, :assessments).where(committees: { faculty_id: @faculty.id })
        @students_pending_assessment = []
        @students_completed_assessment = []

        @students_to_review.each do |student|
          if student.assessments.find { |a| a.faculty == @faculty }
---
SELECT "students".* FROM "students" INNER JOIN "committees" ON "committees"."student_id" = "students"."id" WHERE "committees"."faculty_id" = $1  [["faculty_id", 4]]
SELECT "students".* FROM "students" INNER JOIN "committees" ON "committees"."student_id" = "students"."id" WHERE "committees"."faculty_id" = $1  [["faculty_id", 5]]
SELECT "assessments".* FROM "assessments" WHERE "assessments"."student_id" = $1 AND "assessments"."faculty_id" = $2 LIMIT $3  [["student_id", 11], ["faculty_id", 6], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 9], ["LIMIT", 1]]
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]

    def review_student
      @student = Student.find(params[:id])
      @documents = StudentDocument.where(email_id: @student.email_id)

      if @documents.empty?
        @no_documents_message = 'This student has not submitted any documents.'
      else
        @resume_url = @documents.first.resume_link
        @report_url = @documents.first.report_link
        @private_comments = Assessment.where(student_id: @student.id).where.not(faculty_id: current_faculty.id)
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "student_documents".* FROM "student_documents" WHERE "student_documents"."email_id" = $1 ORDER BY "student_documents"."id" ASC LIMIT $2  [["email_id", "harshsurolia@tamu.edu"], ["LIMIT", 1]]
SELECT 1 AS one FROM "student_documents" WHERE "student_documents"."email_id" = $1 LIMIT $2  [["email_id", "harshsurolia@tamu.edu"], ["LIMIT", 1]]
SELECT "assessments".* FROM "assessments" WHERE "assessments"."student_id" = $1 AND "assessments"."faculty_id" != $2  [["student_id", 11], ["faculty_id", 5]]

    def save_assessment
      @student = Student.find(params[:id])

      @assessment = Assessment.find_or_initialize_by(student: @student, faculty: current_faculty)
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 11], ["LIMIT", 1]]
SELECT "assessments".* FROM "assessments" WHERE "assessments"."student_id" = $1 AND "assessments"."faculty_id" = $2 LIMIT $3  [["student_id", 2], ["faculty_id", 2], ["LIMIT", 1]]

    def view_assessment
      # Find the student based on the provided ID
      @student = Student.find(params[:id])

      # Find the assessment for the current faculty and student
      @assessment = Assessment.find_by(student: @student, faculty: current_faculty)
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
SELECT "assessments".* FROM "assessments" WHERE "assessments"."student_id" = $1 AND "assessments"."faculty_id" = $2 LIMIT $3  [["student_id", 2], ["faculty_id", 1], ["LIMIT", 1]]

  def current_faculty
    @current_faculty ||= Faculty.find_by(id: session[:faculty_id]) if session[:faculty_id]
---
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]