app/controllers/student_documents_controller.rb

SELECT "student_documents".* FROM "student_documents" WHERE "student_documents"."email_id" = $1 LIMIT $2  [["email_id", "a@tamu.edu"], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."email_id" = $1 LIMIT $2  [["email_id", "a@tamu.edu"], ["LIMIT", 1]]
---
  def index
    @student_document = StudentDocument.find_or_initialize_by(email_id: session[:email])
    @student_data = Student.find_or_initialize_by(email_id: session[:email])

SELECT "student_documents".* FROM "student_documents" WHERE "student_documents"."email_id" = $1 LIMIT $2  [["email_id", "neha@tamu.edu"], ["LIMIT", 1]]
---
  def show
    @student_documents = StudentDocument.find_or_initialize_by(email_id: session[:email])

UPDATE "student_documents" SET "resume_file" = $1, "report_file" = $2, "updated_at" = $3 WHERE "student_documents"."id" = $4  [["resume_file", "<56 bytes of binary data>"], ["report_file", "<56 bytes of binary data>"], ["updated_at", "2023-10-19 14:00:39.833722"], ["id", 9]]
UPDATE "student_documents" SET "resume_file" = $1, "report_file" = $2, "updated_at" = $3 WHERE "student_documents"."id" = $4  [["resume_file", "<56 bytes of binary data>"], ["report_file", "<56 bytes of binary data>"], ["updated_at", "2023-10-19 14:44:13.666582"], ["id", 9]]
---
  def update
    if params[:student_document][:support_in_last_sem_description].present? && !params[:student_document][:support_in_last_sem_description] == "None"
      params[:student_document][:support_in_last_sem_description] = params[:student_document][:support_in_last_sem_description].reject(&:empty?)
    end
    if params[:student_document][:support_in_last_sem_description].present? && params[:student_document][:support_in_last_sem_description] == "None"
      params[:student_document][:support_in_last_sem_description] = [""]
    end
    current_email = session[:email].dup
    current_email.gsub!(/@tamu\.edu/, '')
    flash.clear

    # clear the session
    @student_document.resume_file  = nil
    @student_document.report_file  = nil
    @student_document.milestones_passed = nil
    @student_document.improvement_plan_present = nil
    @student_document.improvement_plan_summary = nil
    @student_document.gpa = nil
    @student_document.support_in_last_sem = nil
    @student_document.support_in_last_sem_description = nil
    @student_document.number_of_paper_submissions = nil
    @student_document.number_of_papers_published = nil

    if @student_document.update(student_document_params)
      if params[:student_document][:resume_file].present?

        #save the resume in s3 bucket in the name of email id. This will be file key
        input_string_resume = "#{current_email}_resume"

        #store the resume file name in database
        @student_document.update(resume_file: input_string_resume)

UPDATE "student_documents" SET "updated_at" = $1, "improvement_plan_summary" = $2 WHERE "student_documents"."id" = $3  [["updated_at", "2023-10-07 04:02:57.399314"], ["improvement_plan_summary", "sgdfasa"], ["id", 2]]
---
        presigned_url_resume = presigner.presigned_url(:get_object,bucket: bucket_name, key: input_string_resume, expires_in: 604800)

        #update the resume_link column with link to the resume file
        @student_document.update(resume_link: presigned_url_resume)

UPDATE "student_documents" SET "updated_at" = $1, "improvement_plan_summary" = $2 WHERE "student_documents"."id" = $3  [["updated_at", "2023-10-12 07:13:51.316676"], ["improvement_plan_summary", ""], ["id", 13]]
---
        input_string_report = "#{current_email}_report"

        #store the report file name in database
        @student_document.update(report_file: input_string_report)

UPDATE "student_documents" SET "report_file" = $1, "updated_at" = $2 WHERE "student_documents"."id" = $3  [["report_file", "<11 bytes of binary data>"], ["updated_at", "2023-10-19 14:38:04.402433"], ["id", 9]]
UPDATE "student_documents" SET "report_file" = $1, "updated_at" = $2 WHERE "student_documents"."id" = $3  [["report_file", "<11 bytes of binary data>"], ["updated_at", "2023-10-19 14:44:14.151280"], ["id", 9]]
UPDATE "student_documents" SET "resume_link" = $1, "updated_at" = $2 WHERE "student_documents"."id" = $3
UPDATE "student_documents" SET "updated_at" = $1, "report_link" = $2 WHERE "student_documents"."id" = $3
UPDATE "student_documents" SET "report_file" = $1, "updated_at" = $2 WHERE "student_documents"."id" = $3  [["report_file", "<11 bytes of binary data>"], ["updated_at", "2023-10-19 14:48:05.510535"], ["id", 9]]
UPDATE "student_documents" SET "report_file" = $1, "updated_at" = $2 WHERE "student_documents"."id" = $3  [["report_file", "<11 bytes of binary data>"], ["updated_at", "2023-10-19 14:56:09.129329"], ["id", 9]]
---
        presigned_url_report = presigner.presigned_url(:get_object,bucket: bucket_name, key: input_string_report, expires_in: 604800)

        #update the report_link column with link to the report file
        @student_document.update(report_link: presigned_url_report)
      end

        #update other columns
        @student_document.update(phd_start_date: params[:student_document][:phd_start_date])
        @student_document.update(milestones_passed: params[:student_document][:milestones_passed])
        @student_document.update(improvement_plan_present: params[:student_document][:improvement_plan_present])
        @student_document.update(improvement_plan_summary: params[:student_document][:improvement_plan_summary])
        @student_document.update(gpa: params[:student_document][:gpa])
        @student_document.update(support_in_last_sem: params[:student_document][:support_in_last_sem])
        @student_document.update(support_in_last_sem_description: params[:student_document][:support_in_last_sem_description])
        @student_document.update(number_of_paper_submissions: params[:student_document][:number_of_paper_submissions])
        @student_document.update(number_of_papers_published: params[:student_document][:number_of_papers_published])

SELECT "student_documents".* FROM "student_documents" WHERE "student_documents"."email_id" = $1 LIMIT $2  [["email_id", "abc1@tamu.edu"], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."email_id" = $1 LIMIT $2  [["email_id", "abc1@tamu.edu"], ["LIMIT", 1]]
---
    def set_student_document
      @student_document = StudentDocument.find_or_initialize_by(email_id: session[:email])
      @student = Student.find_or_initialize_by(email_id: session[:email])