app/controllers/student_controller.rb

SELECT "students".* FROM "students" WHERE "students"."email_id" = $1 LIMIT $2  [["email_id", "test@tamu.edu"], ["LIMIT", 1]]
---
    def authenticate
      flash.clear
      @student = Student.find_by(email_id: params[:student][:email_id])

INSERT INTO "students" ("first_name", "last_name", "UIN", "email_id", "password", "created_at", "updated_at", "password_digest") VALUES ($1, $2, $3, $4, $5, $6, $7, $8) RETURNING "id"
---
    def create_signup
      @student = Student.new(student_params)
      if @student.save

SELECT "committees".* FROM "committees" WHERE "committees"."student_id" = $1 ORDER BY role DESC  [["student_id", 2]]
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" IN ($1, $2)  [["id", 5], ["id", 6]]
---
    def edit_committee
      @committee_members = current_student.committees.includes(:faculty).order('role ASC')

SELECT "faculties".* FROM "faculties" WHERE (first_name LIKE '%John%' AND last_name LIKE '%Doe%')
SELECT 1 AS one FROM "faculties" WHERE (first_name LIKE '%%' AND last_name LIKE '%%') LIMIT $1  [["LIMIT", 1]]
---
    def search_faculty
      @results = Faculty.where('first_name LIKE ? AND last_name LIKE ?', "%#{params[:first_name]}%", "%#{params[:last_name]}%")

      # Redirect to edit committee page if the search results are empty
      if @results.empty?

SELECT "committees".* FROM "committees" WHERE "committees"."student_id" = $1 AND "committees"."faculty_id" = $2 LIMIT $3  [["student_id", 11], ["faculty_id", 5], ["LIMIT", 1]]
INSERT INTO "committees" ("student_id", "faculty_id", "created_at", "updated_at", "role") VALUES ($1, $2, $3, $4, $5) RETURNING "id"  [["student_id", 11], ["faculty_id", 5], ["created_at", "2023-10-19 16:44:53.873481"], ["updated_at", "2023-10-19 16:44:53.873481"], ["role", "Member"]]
---
    def add_to_committee
      # Check if the faculty is already in the student's committee
      existing_member = current_student.committees.find_by(faculty_id: params[:faculty_id])

      if existing_member
        flash[:error] = "#{params[:first_name]} #{params[:last_name]} is already in your committee."
      else
        current_student.committees.create(faculty_id: params[:faculty_id], role: 'Member')

SELECT "committees".* FROM "committees" WHERE "committees"."student_id" = $1 AND "committees"."faculty_id" = $2 LIMIT $3  [["student_id", 12], ["faculty_id", 4], ["LIMIT", 1]]
UPDATE "committees" SET "role" = $1 WHERE "committees"."student_id" = $2 AND "committees"."role" = $3  [["role", "Member"], ["student_id", 12], ["role", "Chair"]]
UPDATE "committees" SET "updated_at" = $1, "role" = $2 WHERE "committees"."id" = $3  [["updated_at", "2023-10-21 04:26:48.599274"], ["role", "Chair"], ["id", 7]]
SELECT "committees".* FROM "committees" WHERE "committees"."student_id" = $1 AND "committees"."id" = $2 LIMIT $3  [["student_id", 2], ["id", 5], ["LIMIT", 1]]
---
    def set_as_chair
      member = current_student.committees.find_by(faculty_id: params[:id])

      # Reset any existing chair to a normal member
      current_student.committees.where(role: 'Chair').update_all(role: 'Member')

      # Set the selected member as the chair
      member.update(role: 'Chair')

      flash[:success] = "#{member.faculty.first_name} #{member.faculty.last_name} is now set as the committee chair."

SELECT "committees".* FROM "committees" WHERE "committees"."id" = $1 LIMIT $2  [["id", 7], ["LIMIT", 1]]
UPDATE "committees" SET "updated_at" = $1, "role" = $2 WHERE "committees"."id" = $3  [["updated_at", "2023-10-21 04:27:04.450875"], ["role", "Member"], ["id", 7]]
---
    def return_to_member
      committee = Committee.find(params[:id])
      if committee.update(role: 'Member')

SELECT "assessments"."public_comment", "assessments"."rating", "assessments"."eligible_for_reward", "assessments"."faculty_id" FROM "assessments" WHERE "assessments"."student_id" = $1  [["student_id", 1]]
SELECT "faculties".* FROM "faculties" WHERE "faculties"."id" IN ($1, $2)  [["id", 1], ["id", 2]]
---
    def view_assessments
      @assessments = current_student.assessments
                       .select(:public_comment, :rating, :eligible_for_reward, :faculty_id)
                       .includes(:faculty)

SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 1], ["LIMIT", 1]]
---
    def current_student
      @current_student ||= Student.find(session[:student_id]) if session[:student_id]