app/controllers/student_documents_controller.rb

  def create
   # @student_document = StudentDocument.new(student_document_params)
    @student_document = StudentDocument.find_or_initialize_by(email_id: session[:email])
---
SELECT "student_documents".* FROM "student_documents" WHERE "student_documents"."email_id" = $1 LIMIT $2  [["email_id", "a@tamu.edu"], ["LIMIT", 1]]

  def update
    if @student_document.save
---
UPDATE "student_documents" SET "resume_file" = $1, "updated_at" = $2 WHERE "student_documents"."id" = $3  [["resume_file", "<20 bytes of binary data>"], ["updated_at", "2023-10-07 02:32:30.547048"], ["id", 9]]
INSERT INTO "student_documents" ("resume_file", "resume_link", "email_id", "created_at", "updated_at", "phd_start_date", "milestones_passed", "improvement_plan_present", "improvement_plan_summary", "gpa", "support_in_last_sem", "number_of_paper_submissions", "number_of_papers_published") VALUES ($1, $2, $3, $4, $5, $6, $7, $8, $9, $10, $11, $12, $13) RETURNING "id"

    def set_student_document
      @student_document = StudentDocument.find_or_initialize_by(email_id: session[:email])
      @student = Student.find_or_initialize_by(email_id: session[:email])
---
SELECT "student_documents".* FROM "student_documents" WHERE "student_documents"."email_id" = $1 LIMIT $2  [["email_id", "abc1@tamu.edu"], ["LIMIT", 1]]
SELECT "students".* FROM "students" WHERE "students"."email_id" = $1 LIMIT $2  [["email_id", "abc1@tamu.edu"], ["LIMIT", 1]]