app/controllers/student_controller.rb

    def current_student
      @current_student ||= Student.find(session[:student_id]) if session[:student_id]
---
SELECT "students".* FROM "students" WHERE "students"."id" = $1 LIMIT $2  [["id", 2], ["LIMIT", 1]]